    const data =  [
      {
        "number": 1,
        "name": "Дмитрий Якинто",
        "results": [9.24, 8.94, 8.81, 9.46, 9.72],
        "avg": 9.21
      },

      {
        "number": 2,
        "name": "Илья Соколов",
        "results": [11.76, 11.99, 10.63, 8.92, 11.28],
        "avg": 11.22
      },
      {
        "number": 3,
        "name": "Игорь Селиванов",
        "results": [14.98, 13.01, 11.57, 11.64, 11.49],
        "avg": 12.07
      },
      {
        "number": 4,
        "name": "Кирилл Ослонов",
        "results": [12.12, 24.60, 12.71, 13.50, 12.40],
        "avg": 12.87
      },
      {
        "number": 5,
        "name": "Тимофей Захарченко",
        "results": [13.40, 15.01, 14.09, 11.77, 11.17],
        "avg": 13.09
      },
      {
        "number": 6,
        "name": "Андрей Деревягин",
        "results": [13.93, 15.06, 11.56, 10.86, 14.35],
        "avg": 13.28
      },
      {
        "number": 7,
        "name": "Никита Пак",
        "results": [15.21, 14.49, 10.72, 15.48, 11.71],
        "avg": 13.80
      },
      {
        "number": 8,
        "name": "Дмитрий Салахов",
        "results": [16.01, 22.24, 15.37, 16.22, 12.97],
        "avg": 15.87
      },
      {
        "number": 9,
        "name": "Фаррух Исаков",
        "results": [18.18, 15.00, 15.82, 14.28, 17.30],
        "avg": 16.04
      },
      {
        "number": 10,
        "name": "Баир Павлов",
        "results": [17.26, 18.44, 14.91, 18.41, 15.51],
        "avg": 17.06
      },
      {
        "number": 11,
        "name": "Алексей Батуев",
        "results": [19.76, 18.36, 15.10, 21.06, 14.56],
        "avg": 17.74
      },
      {
        "number": 12,
        "name": "Доржо Цыбенов",
        "results": [19.27, 16.41, 19.64, 18.03, 16.31],
        "avg": 17.90
      },
      {
        "number": 13,
        "name": "Баир Ешиев",
        "results": [18.98, 18.19, 18.17, 21.36, 22.33],
        "avg": 19.51
      },
      {
        "number": 14,
        "name": "Батор Дугаров",
        "results": [23.15, 18.76, 17.95, 18.53, 22.77],
        "avg": 20.02
      },
      {
        "number": 15,
        "name": "Евгений Ким",
        "results": [19.60, 21.32, 29.21, 18.95, 20.97],
        "avg": 20.63
      },
      {
        "number": 16,
        "name": "Данила Махалов",
        "results": [22.83, 22.44, 37.01, 23.61, 25.25],
        "avg": 23.90
      },
      {
        "number": 17,
        "name": "Артур Друженя",
        "results": [17.79, 26.93, 23.74, 24.51, 23.74],
        "avg": 24.00
      },
      {
        "number": 18,
        "name": "Арина Зубова",
        "results": [23.84, 45.60, 20.00, 30.93, 24.55],
        "avg": 26.44
      },
      {
        "number": 19,
        "name": "Цыден Хармакшанов",
        "results": [20.86, 27.92, 28.36, 30.99, 28.49],
        "avg": 28.26
      },
      {
        "number": 20,
        "name": "Хасан Халимжонов",
        "results": [33.56, 28.12, 27.74, 40.65, 37.31],
        "avg": 33.00
      },
      {
        "number": 21,
        "name": "Антон Чернышов",
        "results": [29.38, 29.83, 36.80, 33.91, 37.72],
        "avg": 33.51
      },
      {
        "number": 22,
        "name": "Кирилл Данюк",
        "results": [31.18, 34.81, 31.40, 34.64, 33.14],
        "avg": 33.03
      },
      {
        "number": 23,
        "name": "Вячеслав Рыжков",
        "results": [36.73, 35.88, 34.97, 32.55, 31.66],
        "avg": 34.36
      },
      {
        "number": 24,
        "name": "Артур Карелин",
        "results": [28.06, 43.61, 38.43, 31.51, 28.93],
        "avg": 34.11
      },
      {
        "number": 23,
        "name": "Денис Цыганков",
        "results": [31.52, 34.93, 36.88, 35.00, 32.26],
        "avg": 34.06
      },
      {
        "number": 24,
        "name": "Милана Лонгинова",
        "results": [38.25, 32.51, 29.65, 50.00, 33.50],
        "avg": 34.75
      },
      {
        "number": 25,
        "name": "Ксения Москальцова",
        "results": [32.42, 34.39, 40.15, 44.14, 28.70],
        "avg": 35.65
      },
      {
        "number": 26,
        "name": "Александра Ворошилова",
        "results": [32.65, 39.07, 43.86, 31.99, 38.55],
        "avg": 36.76
      },
      {
        "number": 27,
        "name": "Вячеслав Белоусов",
        "results": [39.91, 39.53, 36.38, 41.60, 36.81],
        "avg": 38.75
      },
      {
        "number": 28,
        "name": "Анастасия Квитченко",
        "results": [50.09, 28.87, 32.70, 47.51, 39.77],
        "avg": 39.99
      },
      {
        "number": 29,
        "name": "Елисей Якинто",
        "results": [59.27, 45.59, 30.76, 40.50, 36.82],
        "avg": 40.97
      },
      {
        "number": 30,
        "name": "Элина Степанова",
        "results": [40.20, 37.72, 50.78, 53.61, 35.35],
        "avg": 42.90
      },
      {
        "number": 31,
        "name": "Адиса Каркунова",
        "results": [54.86, 43.71, 52.24, 42.67, 42.61],
        "avg": 46.21
      },
      {
        "number": 32,
        "name": "Александра Горлова",
        "results": [47.69, 42.18, 56.54, 46.34, 44.72],
        "avg": 46.25
      },
      {
        "number": 33,
        "name": "Екатерина Клименко",
        "results": [48.36, 37.64, 44.00, 49.30, 50.19],
        "avg": 47.22
      },
      {
        "number": 34,
        "name": "Альбина Альминова",
        "results": [57.19, 45.35, 57.09, 50.55, 44.81],
        "avg": 51.00
      }      
    ]
  